In [1]:
import numpy as np
import pandas as pd
pd.set_option("display.max_rows",10)   
pd.set_option("display.max_columns",10)

**数据清洗**
+ 空值(null,NA)
+ 重复值
+ 缺失值处理
+ 异常值
+ 数据转换(transform)

建议阅读Hadley Wickham的[Tidy Data](http://vita.had.co.nz/papers/tidy-data.pdf)

+ The names of the variables are different from what you require
+ There is missing data
+ Values are not in the units that you require
+ The period of sampling of records is not what you need
+ Variables are categorical and you need quantitative values
+ There is noise in the data,
+ Information is of an incorrect type
+ Data is organized around incorrect axes
+ Data is at the wrong level of normalization
+ Data is duplicated

### 读取文件时的NA

In [2]:
eu2012 = pd.read_csv("../data/Eueo2012_na.csv")
eu2012

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,...,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,...,9,0,9,9,16
1,Czech Republic,4,-999,18,41.9%,...,7,0,11,11,19
2,Denmark,4,10,10,50.0%,...,4,0,7,7,15
3,England,5,11,18,50.0%,...,5,0,11,11,16
4,France,3,22,24,37.9%,...,6,0,11,11,19
...,...,...,...,...,...,...,...,...,...,...,...
11,Republic of Ireland,1,7,12,36.8%,...,6,1,10,10,17
12,Russia,5,9,31,22.5%,...,6,0,7,7,16
13,Spain,12,42,33,55.9%,...,11,0,17,17,18
14,xyz,5,17,19,47.2%,...,7,0,9,9,18
15,Ukraine,2,7,26,21.2%,...,5,0,9,9,18

In [3]:
eu2012.isnull().sum()

Team                 0
Goals                0
Shots on target      0
Shots off target     0
Shooting Accuracy    0
                    ..
Yellow Cards         0
Red Cards            0
Subs on              0
Subs off             0
Players Used         0
dtype: int64

In [4]:
eu2012.isnull().sum().sum()

2

In [5]:
eu2012 = pd.read_csv("../data/Eueo2012_na.csv", na_values=['xyz'])
eu2012.isnull().sum().sum()

3

In [6]:
eu2012['Team']

0                 Croatia
1          Czech Republic
2                 Denmark
3                 England
4                  France
             ...
11    Republic of Ireland
12                 Russia
13                  Spain
14                    NaN
15                Ukraine
Name: Team, dtype: object

In [7]:
eu2012 = pd.read_csv("../data/Eueo2012_na.csv", na_values=['NA','xyz','-999'])
eu2012.isnull().sum().sum()

4

### 构造一个带NaN的 data frame

In [8]:
df = pd.DataFrame(np.random.randint(0,100,15).reshape(5, 3),
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['c1', 'c2', 'c3'])
df

   c1  c2  c3
a  97  23  87
b  49  42  59
c  85  58  17
d  22  52  65
e  72  82   5

In [9]:
df['c4']=np.nan
df.loc['f']=np.arange(10,14)
df.loc['g']=np.nan
df['c5']=np.nan
df['c4']['a']=18
df

     c1    c2    c3    c4  c5
a  97.0  23.0  87.0  18.0 NaN
b  49.0  42.0  59.0   NaN NaN
c  85.0  58.0  17.0   NaN NaN
d  22.0  52.0  65.0   NaN NaN
e  72.0  82.0   5.0   NaN NaN
f  10.0  11.0  12.0  13.0 NaN
g   NaN   NaN   NaN   NaN NaN

### 判断NaN

In [10]:
df.isnull()

      c1     c2     c3     c4    c5
a  False  False  False  False  True
b  False  False  False   True  True
c  False  False  False   True  True
d  False  False  False   True  True
e  False  False  False   True  True
f  False  False  False  False  True
g   True   True   True   True  True

In [11]:
df.isnull().sum()

c1    1
c2    1
c3    1
c4    5
c5    7
dtype: int64

In [12]:
df.isnull().sum(axis=1)

a    1
b    2
c    2
d    2
e    2
f    1
g    5
dtype: int64

In [13]:
df.isnull().sum().sum()

15

In [14]:
df.count()  #统计not null

c1    6
c2    6
c3    6
c4    2
c5    0
dtype: int64

In [15]:
df.notnull()

      c1     c2     c3     c4     c5
a   True   True   True   True  False
b   True   True   True  False  False
c   True   True   True  False  False
d   True   True   True  False  False
e   True   True   True  False  False
f   True   True   True   True  False
g  False  False  False  False  False

### 过滤或者去掉缺失值

In [16]:
df.c4[df.c4.notnull()]

a    18.0
f    13.0
Name: c4, dtype: float64

In [17]:
df.c4.dropna()  #inplace=False

a    18.0
f    13.0
Name: c4, dtype: float64

In [18]:
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

In [19]:
df.dropna(how='all')

     c1    c2    c3    c4  c5
a  97.0  23.0  87.0  18.0 NaN
b  49.0  42.0  59.0   NaN NaN
c  85.0  58.0  17.0   NaN NaN
d  22.0  52.0  65.0   NaN NaN
e  72.0  82.0   5.0   NaN NaN
f  10.0  11.0  12.0  13.0 NaN

In [20]:
df.dropna(how='all',axis=1)

     c1    c2    c3    c4
a  97.0  23.0  87.0  18.0
b  49.0  42.0  59.0   NaN
c  85.0  58.0  17.0   NaN
d  22.0  52.0  65.0   NaN
e  72.0  82.0   5.0   NaN
f  10.0  11.0  12.0  13.0
g   NaN   NaN   NaN   NaN

In [21]:
df2=df.copy()
df2.ix['g'].c1=0
df2.ix['g'].c3=0
df2

     c1    c2    c3    c4  c5
a  97.0  23.0  87.0  18.0 NaN
b  49.0  42.0  59.0   NaN NaN
c  85.0  58.0  17.0   NaN NaN
d  22.0  52.0  65.0   NaN NaN
e  72.0  82.0   5.0   NaN NaN
f  10.0  11.0  12.0  13.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [22]:
df2.dropna(how='any',axis=1)

     c1    c3
a  97.0  87.0
b  49.0  59.0
c  85.0  17.0
d  22.0  65.0
e  72.0   5.0
f  10.0  12.0
g   0.0   0.0

In [23]:
df2.dropna(thresh=5,axis=1)

     c1    c2    c3
a  97.0  23.0  87.0
b  49.0  42.0  59.0
c  85.0  58.0  17.0
d  22.0  52.0  65.0
e  72.0  82.0   5.0
f  10.0  11.0  12.0
g   0.0   NaN   0.0

### 计算中的NaN处理

In [24]:
a=np.array([np.nan,1,2,np.nan,3])
a

array([ nan,   1.,   2.,  nan,   3.])

In [25]:
s=pd.Series(a)
s

0    NaN
1    1.0
2    2.0
3    NaN
4    3.0
dtype: float64

In [26]:
a.mean(),s.mean()

(nan, 2.0)

In [27]:
df2.c4+1

a    19.0
b     NaN
c     NaN
d     NaN
e     NaN
f    14.0
g     NaN
Name: c4, dtype: float64

In [28]:
df2.c4.cumsum()

a    18.0
b     NaN
c     NaN
d     NaN
e     NaN
f    31.0
g     NaN
Name: c4, dtype: float64

### 填充缺失值

In [29]:
fill_0=df.fillna(0)
fill_0

     c1    c2    c3    c4   c5
a  97.0  23.0  87.0  18.0  0.0
b  49.0  42.0  59.0   0.0  0.0
c  85.0  58.0  17.0   0.0  0.0
d  22.0  52.0  65.0   0.0  0.0
e  72.0  82.0   5.0   0.0  0.0
f  10.0  11.0  12.0  13.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [30]:
df

     c1    c2    c3    c4  c5
a  97.0  23.0  87.0  18.0 NaN
b  49.0  42.0  59.0   NaN NaN
c  85.0  58.0  17.0   NaN NaN
d  22.0  52.0  65.0   NaN NaN
e  72.0  82.0   5.0   NaN NaN
f  10.0  11.0  12.0  13.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [31]:
df.fillna(0,limit=3) # 每列中的limit

     c1    c2    c3    c4   c5
a  97.0  23.0  87.0  18.0  0.0
b  49.0  42.0  59.0   0.0  0.0
c  85.0  58.0  17.0   0.0  0.0
d  22.0  52.0  65.0   0.0  NaN
e  72.0  82.0   5.0   NaN  NaN
f  10.0  11.0  12.0  13.0  NaN
g   0.0   0.0   0.0   NaN  NaN

In [32]:
df.c4

a    18.0
b     NaN
c     NaN
d     NaN
e     NaN
f    13.0
g     NaN
Name: c4, dtype: float64

In [33]:
df.c4.fillna(method='ffill')

a    18.0
b    18.0
c    18.0
d    18.0
e    18.0
f    13.0
g    13.0
Name: c4, dtype: float64

In [34]:
df.c4.fillna(method='bfill')

a    18.0
b    13.0
c    13.0
d    13.0
e    13.0
f    13.0
g     NaN
Name: c4, dtype: float64

In [35]:
fill_values=pd.Series([1,2],index=['b','c'])

In [36]:
df.c4.fillna(fill_values)

a    18.0
b     1.0
c     2.0
d     NaN
e     NaN
f    13.0
g     NaN
Name: c4, dtype: float64

In [37]:
df.fillna(df.mean())

          c1         c2         c3    c4  c5
a  97.000000  23.000000  87.000000  18.0 NaN
b  49.000000  42.000000  59.000000  15.5 NaN
c  85.000000  58.000000  17.000000  15.5 NaN
d  22.000000  52.000000  65.000000  15.5 NaN
e  72.000000  82.000000   5.000000  15.5 NaN
f  10.000000  11.000000  12.000000  13.0 NaN
g  55.833333  44.666667  40.833333  15.5 NaN

### 插值

In [38]:
s=pd.Series([1,2,np.nan,5,np.nan,9])
s

0    1.0
1    2.0
2    NaN
3    5.0
4    NaN
5    9.0
dtype: float64

In [35]:
s.interpolate()

0    1.0
1    2.0
2    3.5
3    5.0
4    7.0
5    9.0
dtype: float64

In [39]:
import datetime

In [39]:
ts = pd.Series([1, np.nan, 2],
               index=[datetime.datetime(2016, 1, 1),
                      datetime.datetime(2016, 2, 1),
                      datetime.datetime(2016, 4, 1)])
ts

2016-01-01    1.0
2016-02-01    NaN
2016-04-01    2.0
dtype: float64

In [40]:
ts.interpolate()

2016-01-01    1.0
2016-02-01    1.5
2016-04-01    2.0
dtype: float64

In [41]:
ts.interpolate(method='time')

2016-01-01    1.000000
2016-02-01    1.340659
2016-04-01    2.000000
dtype: float64

In [42]:
s = pd.Series([0, np.nan, 20], index=[0, 1, 10])
s

0      0.0
1      NaN
10    20.0
dtype: float64

In [43]:
s.interpolate()

0      0.0
1     10.0
10    20.0
dtype: float64

In [44]:
s.interpolate(method='values')

0      0.0
1      2.0
10    20.0
dtype: float64

### 重复值

In [40]:
data = pd.DataFrame({'a': ['x'] * 3 + ['y'] * 4,
                     'b': [1, 1, 2, 3, 3, 4, 4]})
data

   a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4

In [46]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

   a  b
0  x  1
2  x  2
3  y  3
5  y  4

In [49]:
data.drop_duplicates(keep='last')

   a  b
1  x  1
2  x  2
4  y  3
6  y  4

In [41]:
data['c']=np.arange(7)
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [42]:
data

   a  b  c
0  x  1  0
1  x  1  1
2  x  2  2
3  y  3  3
4  y  3  4
5  y  4  5
6  y  4  6

In [43]:
data.drop_duplicates(['a','b'])

   a  b  c
0  x  1  0
2  x  2  2
3  y  3  3
5  y  4  5

### transform

In [52]:
x = pd.Series({"one": 1, "two": 2, "three": 3})
y = pd.Series({1: "a", 2: "b", 3: "c"})

In [53]:
x.map(y)

one      a
three    c
two      b
dtype: object

In [44]:
df=pd.DataFrame({'c1':['a']*3+['b']*4,
'c2':[1,1,2,3,3,4,4]})
df

  c1  c2
0  a   1
1  a   1
2  a   2
3  b   3
4  b   3
5  b   4
6  b   4

In [59]:
df.replace(1,5)

  c1  c2
0  a   5
1  a   5
2  a   2
3  b   3
4  b   3
5  b   4
6  b   4

In [60]:
df.replace('a','x')

  c1  c2
0  x   1
1  x   1
2  x   2
3  b   3
4  b   3
5  b   4
6  b   4

In [46]:
s=pd.Series([0,1,2,3,4])
s.replace(0,-1)

0   -1
1    1
2    2
3    3
4    4
dtype: int64

In [47]:
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [62]:
s.replace([0,1,2,3,4],[4,3,2,1,0])

0    4
1    3
2    2
3    1
4    0
dtype: int64

In [48]:
s.replace({0:-1,1:10})

0    -1
1    10
2     2
3     3
4     4
dtype: int64

In [49]:
df = pd.DataFrame({'a': [0, 1, 2, 3, 4], 'b': [5, 6, 7, 8, 9]})
df

   a  b
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

In [66]:
df.replace({'a': 1, 'b': 8}, 100)

     a    b
0    0    5
1  100    6
2    2    7
3    3  100
4    4    9

In [50]:
df = pd.DataFrame(np.arange(12).reshape(4, 3),columns=['a', 'b', 'c'])
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [69]:
df.apply(lambda col: col.sum())

a    18
b    22
c    26
dtype: int64

In [51]:
df.apply(lambda row: row.sum(), axis=1)

0     3
1    12
2    21
3    30
dtype: int64

In [72]:
df['interim'] = df.apply(lambda r: r.a * r.b, axis=1)
df

   a   b   c  interim
0  0   1   2        0
1  3   4   5       12
2  6   7   8       42
3  9  10  11       90

In [73]:
df['result'] = df.apply(lambda r: r.interim + r.c, axis=1)
df

   a   b   c  interim  result
0  0   1   2        0       2
1  3   4   5       12      17
2  6   7   8       42      50
3  9  10  11       90     101

### outlier

In [76]:
df=pd.DataFrame({'Data':np.random.normal(size=200)})
df.head()

       Data
0 -1.168496
1  0.895358
2 -0.257931
3 -2.186879
4 -1.179821

In [77]:
df[np.abs(df.Data-df.Data.mean())<=(2*df.Data.std())]

         Data
0   -1.168496
1    0.895358
2   -0.257931
4   -1.179821
5   -0.535962
..        ...
195 -1.097275
196 -0.689324
197  1.228156
198  0.235689
199 -0.867421

[192 rows x 1 columns]

In [78]:
mask=np.abs(df.Data-df.Data.mean())>=(2*df.Data.std())
df[mask]

         Data
3   -2.186879
18   2.006751
62  -2.880784
114  1.993500
129  2.039295
151  2.458363
158  2.091859
186  1.947866

In [79]:
df[mask]=df.Data.mean()

In [80]:
df[mask]

         Data
3   -0.146695
18  -0.146695
62  -0.146695
114 -0.146695
129 -0.146695
151 -0.146695
158 -0.146695
186 -0.146695